Delans-TLE/src/InformationRegisters/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров</name>
  <comment>Хранит комбинацию ПравилоОбмена - Сотрудник(курьер)</comment>
  <resources>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров/Forms/ФормаЗаполненияПользователяИПароля/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ГотовоНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ГотовоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Оборудование КАК Оборудование
	|ИЗ
	|	РегистрСведений.ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров КАК ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Оборудование) Тогда
			УстановитьЗначениеВРегистре(Пользователь, Пароль, Выборка.Оборудование);
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеВРегистре(Знач Пользователь, Знач Пароль, Знач Оборудование)
	
	НаборЗаписей = РегистрыСведений.ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оборудование.Установить(Оборудование);
	НаборЗаписей.Прочитать();
	
	ТЗ = НаборЗаписей.Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		
		СтрокаДанных = ТЗ[0];
		СтрокаДанных.Пользователь	= Пользователь;
		СтрокаДанных.Пароль			= Пароль;
		НаборЗаписей.Загрузить(ТЗ);
		Попытка
			НаборЗаписей.Записать(Истина);
	    Исключение
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры
